<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

use App\Models\Theme;

class ThemeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $sallaThemes = json_decode('{
            "1247874246": "رائد", "568597563": "نمو", "2038173539": "واثق", "404046066": "فريد", "392563753": "زيين",
            "766360058": "فخامة", "1617628556": "امتياز", "1034648396": "ملاك", "1696219221": "وسام", "197173496": "مختلف",
            "575338046": "طاهر", "513499943": "بريستيج", "268429610": "نمو", "1245464956": "جميل", "1049159835": "موعد",
            "600639717": "كليك", "466157229": "أكاسيا", "2048178472": "بيوتي", "1480248829": "متجر", "2101895899": "رهيب",
            "1894368909": "اطلالة", "1974201424": "رؤية", "1660707346": "رقمى", "581928698": "سيليا", "1753517624": "عالي",
            "1755865368": "بوتيك", "1253916907": "بيلا", "724522601": "مبدع", "1048198927": "شوبنج", "2093313756": "يافا",
            "2142196958": "بريق", "1016570170": "علا", "2071596307": "جلامور", "1485429532": "ريس", "539684003": "خيوط",
            "1462103872": "قصص", "1145699248": "كراون", "338190499": "كيان", "1582624105": "لوفيزا", "368921700": "نماء",
            "1662840947": "ماركت", "245671147": "روح", "822457965": "عطاء", "1546328629": "سمارت", "638956130": "ثمن",
            "945336214": "ساجي", "1827574400": "رناواي", "596333041": "ابداع", "1534326188": "رِحلة", "1460868166": "آرت",
            "502925332": "جلوبى", "268341705": "ذهب", "1544606478": "مرح", "265993961": "عِنان", "1241617822": "رحيق",
            "2084773836": "فريشمارت", "1822327849": "قهوة", "429755461": "غنا", "1780291170": "بيانو", "510413540": "فاشون",
            "781706584": "جميلة", "1577196143": "بليند", "77875411": "جولدن", "1734608997": "بـريـس_تـا", "1980654236": "خيال",
            "1984184780": "سبورتفاي", "1086321417": "الأصايل", "1424507866": "لمسة", "138027263": "تيرا", "592734670": "جوتراد",
            "569197373": "نماء", "1651680021": "نقاء", "1263602201": "نسيج", "1369561097": "جليمر", "1688297410": "مواسم",
            "1350850078": "شيك", "1057862511": "ليجو", "2116815542": "مسالم", "125310300": "بهجة", "980620793": "مذاق",
            "755871446": "رواسي", "2002897911": "ارتقاء", "1041107384": "بلور", "800211181": "ياسمين", "220469314": "ستوريا",
            "217796426": "نجم", "1592946635": "ألوري", "1141799720": "ايكو", "765784172": "حرير", "845406978": "اكسترا",
            "1082561676": "أيقونة", "1111293706": "أصيل", "342617772": "سيمتا", "1467724464": "رونق", "1155479931": "زينة",
            "519786499": "إسبارك", "996088907": "إلكترون", "2068030156": "سكري", "281718707": "منيو", "2134291879": "اثاث",
            "47569131": "ديجيتال", "1818347309": "لونا", "1739537572": "لوكس", "1189444482": "الكترا", "1789924449": "ستيباب",
            "1599379264": "بروتال", "835771272": "فنجال", "711411447": "أناقة", "251824297": "يافا", "1688984101": "تكنو",
            "324447868": "بارت", "1154792728": "طيبة", "1318482578": "فارماسال", "323037919": "مزايا", "934614468": "ليله",
            "943837848": "ترس", "965120482": "وهج", "1663988716": "لافندر", "76413068": "رالي", "209047556": "تسوق",
            "1921336991": "فلوريزا", "319706053": "فلورا", "2132142397": "جوي توي", "892216257": "ليالي", "1925842409": "شهد",
            "1456070295": "ليما", "856288425": "أريكة", "980393132": "رقي", "1049559847": "بِينْك", "498132723": "أكتيف",
            "107546260": "درب", "1946175377": "ريأكت", "531843130": "بيور", "221156517": "تمور", "826595551": "طراز",
            "1257369338": "طراز", "763160707": "عِنان", "1136099780": "فيو", "650711604": "ديجيتال", "1783594117": "طيف",
            "519299094": "فخر", "841594907": "بيتسي", "1029300075": "أُنس", "1313325318": "أمان", "1953037787": "ريترو",
            "1515734710": "هنا", "1482518396": "بايرلين", "1121414454": "ترف", "124595202": "مخمل", "1524733148": "وشاح",
            "1100239379": "سيري", "894085812": "سينت", "1600326275": "وجهة", "867325509": "عبق", "538856565": "أريكة",
            "1379094127": "جراي", "2140394614": "مليكة", "1514818822": "ريبو", "416209744": "سيرة", "1886663628": "تميز",
            "1349888690": "فاتن", "663056354": "جواهر", "166626249": "كفو", "1155192228": "نايا", "1568224047": "بن",
            "963236070": "نسيج", "1541775946": "تسالي", "844379262": "سكر", "697955958": "ريان", "264294837": "أفق",
            "58708512": "تراڤو", "626232485": "جوري", "1133027754": "نقي", "258399580": "ألوان", "667468690": "رابـــِــح",
            "93404080": "رابـــِــح", "1440982161": "رويال", "2065800929": "سوم", "1440981498": "مَخْمَل",
            "1951088007": "محصول", "1773372150": "فائق", "683129327": "مزايا", "1592433390": "محرك", "40297589": "روعة",
            "815383924": "قمر", "2103324124": "نوريا", "594611923": "بلاك", "1368715218": "رانيورا", "904045008": "كسرة",
            "239035350": "ساند", "1012024533": "أثر", "2046993724": "نايا", "1576058571": "كاكاو", "312769175": "جوهرة",
            "1995586709": "فاتن", "1783846755": "تميز", "1497101358": "سفرة", "1873032143": "ريبو", "1107969023": "مليكة",
            "1910425985": "جراي", "428970927": "أثينا", "146864721": "عبق", "485674501": "وجهة", "238641881": "سينت",
            "1121878777": "سيري", "1464234984": "وشاح", "1947889931": "كلاسيك", "186469831": "ترف", "1622993825": "بايرلين",
            "1327703065": "هنا", "1187766038": "ريترو", "2091965330": "أمان", "1110782388": "أُنس", "777330487": "بيتسي",
            "39105770": "فخر", "1017065877": "طيف", "1655837332": "ديجيتال", "2140366990": "فيو", "1825202310": "عِنان",
            "54522868": "طراز", "827512043": "تمور", "1029861527": "بيور", "598004948": "ريأكت", "1814171761": "درب",
            "306573680": "أكتيف", "302961717": "بِينْك", "1075950900": "رُقي", "1810145234": "أريكة", "505311441": "سيليا",
            "1797146889": "شهد", "241705472": "ليالي", "485056801": "جوي توي", "1185257977": "فلورا", "1776892441": "فلوريزا",
            "842694915": "تسوق", "619807266": "رالي", "1598371733": "لافندر", "1138588187": "وهج", "1556066333": "ترس",
            "821326355": "ليله", "1791753848": "ماكس", "836284701": "فارماسال", "1068142312": "طيبه", "535882890": "براند",
            "1351879850": "تكنو", "114290089": "تاج", "1865839635": "أناقة", "2113118697": "فنجال", "1057953436": "بروتال",
            "740215998": "بريستيج", "1378987453": "زاهر", "1556551807": "فخامة", "1548352431": "مُختلف", "814202285": "زين",
            "1723506348": "امتياز", "349994915": "وسام", "989286562": "فريد", "1764372897": "واثق", "73130640": "عالي",
            "1130931637": "ملاك", "5541564": "كليك", "1298199463": "رائد"
        }', true);

        $zidThemes = json_decode('{
            "44213182-c478-41b6-841b-c6d2fffe6be3": "موج العود",
            "4b0a29b7-5e75-401f-aee7-ee3316820b26": "شوفاي",
            "f9f0914d-3c58-493b-bd83-260ed3cb4e82": "سوفت",
            "8ba6ae26-32ea-4271-81b2-0d9d6804a473": "اشراق",
            "20e10dd5-cf9d-4a6c-87d3-bfecd5a7b4d6": "غسق",
            "ada248fd-a964-40b0-99ab-0a3c6d316f88": "راناواي",
            "8f1390a5-89d7-4ee8-ad6a-21ee9dd5103b": "جاما",
            "1dfc41af-b288-43f4-bedf-d2de974ecd80": "جاما",
            "1eb6bb46-1c14-4a5d-b11d-7c329a9985b6": "لوكس",
            "fd242cb5-1003-4526-8ea0-b2124d1a7f2e": "تميز (احترافي)",
            "4974ba37-b490-43b6-b4ab-188e74494ae2": "دارك",
            "41989791-8180-41c5-b68c-4b57d123762e": "لوفيزا",
            "2d3a8786-4282-4951-b0ed-cb9a1f835586": "رولز",
            "5ac8bff0-86d6-4cbe-842b-c7d853fb14ec": "ابتكار",
            "2ee516f5-9bc7-4895-b39c-b54865e36e93": "الأصايل",
            "3071d086-e7e1-4043-9ecb-5fe1d1c3405b": "الأصايل",
            "f8ad52f6-e6cf-4b1f-9605-e1cf3bb0fee5": "قصص",
            "a7246731-95b9-45ac-b03f-d9e981b57db4": "الملكي",
            "5a225613-8a35-4692-8348-517ea2b98b7b": "بلور",
            "fd11a287-c19e-4977-adcd-e918cec1afdb": "ستايل",
            "2f2af20a-f9e8-468d-a2ce-cafec2b4f511": "رقمي",
            "26f48a8b-9e4e-42c4-ae00-2be6a84f3a7c": "رُقي",
            "f0f4165c-73c2-41d8-817b-60bd0804ee4c": "زيادة",
            "2d2b5e89-cbd7-4211-aa8f-69eaa2f7121f": "كيان",
            "f951e4c7-fb2d-4a49-80e1-ec4e0d8b23aa": "لؤلؤ",
            "9b3c76ff-9881-495b-a95a-0e3356e0718b": "فوود توب",
            "ef6a5e40-1974-4ba9-b6a0-0443e09cd5fc": "ريس",
            "90565842-c024-4232-a369-7addfc45bf99": "بكسلة",
            "0475e33f-de73-4d10-beb9-adb39f053709": "قولدن",
            "35ec26f7-5480-4af7-9c0d-65af112b2f96": "مورف",
            "951883df-71c5-48e5-8a7f-03dce06b3011": "بريق",
            "f6eb5409-0158-4974-82bc-44e79728a5ba": "الكترو",
            "7e330b9d-bf73-45b3-83d7-2f64e63c057f": "جلامور",
            "bf7c44aa-a3d5-4739-98e9-2ef7701f1629": "بيسان",
            "23968bb5-d8f9-49f3-81f1-e7e4d54322da": "اورجانيك",
            "9c2fd906-fb7d-4a71-9cda-1f82580085f9": "زمرد",
            "e8e1ed4f-8683-46be-8b32-3a186a4fb5e7": "فيرجن4",
            "ed6efba9-7ce3-44f0-9e09-ccfa70222722": "حسام",
            "3cdfe750-5b32-4827-90fe-d3febcc38200": "اريكة",
            "c31006fb-d11d-46d1-b2d7-ea92dc1d987b": "ريو",
            "c6acee5f-a4ae-4cc0-b3c0-6803d9c6499b": "بيتس",
            "af00435d-4851-4b1f-b156-45bbf57ea3d9": "سبورتفاي",
            "aedfd94c-e16e-4512-8a7a-187578b2bb92": "رقية",
            "ba5a6c88-04e5-4385-82bc-31514232029a": "إبراق",
            "75d03a09-2ae2-40f4-b735-ee1f8bd11da3": "فرح",
            "a84f959d-39ed-4e00-b21f-6c101fe122ce": "جلوبى",
            "7ead95af-938b-4cfe-92b2-a08b4b920692": "عالم الأثاث",
            "2dbfb7b2-86f1-43d7-9caa-7d99a9023442": "ألفا",
            "518835e2-e5fb-47e1-91c9-3aa9b6aea9a9": "الأمل",
            "5ddcdb1e-d89e-4df6-b52e-7250c814e8c0": "فودي",
            "e7516d73-d9c3-4296-b2fc-1180b366097e": "ريغالو",
            "86b4dd64-dbc4-4908-b7a8-a669376a8fa7": "ترندي",
            "c93a16ab-c272-42a2-b2b1-82dd66dcdd54": "ســـــنور",
            "443035a0-9fe9-4105-ab8a-5eaf789be5c2": "تكنولوجي",
            "355c5bee-200f-44fd-b0cb-90fe67043ac5": "مذاق",
            "bb4149c1-ee82-458d-97c0-ba07092f0218": "لوكشري",
            "adcdabf2-d6f1-4194-9d41-7b8f5c545302": "فريش مارت",
            "f71999e8-e5b2-4eda-bb7c-f16aca944f56": "الرائد",
            "97e09838-7907-46ed-9d59-150d5ac955e2": "ياسمين",
            "42d39573-bbb5-47c4-a5ee-2441e185a336": "رونــق",
            "cfd36d69-0997-42a1-9239-1a673f212465": "حكاية",
            "2602e97a-26b5-4b68-bc4f-d85db332ad48": "غلو",
            "cb736ce4-8918-4a4d-ad8a-82b23c00f830": "ريسبون",
            "64b3d141-339d-4f23-bbd3-9c7f22c6c393": "فاست",
            "2ac49daf-bf9e-42cf-b25d-97979e5deabc": "الرياضي",
            "6d711e31-9110-4b12-817a-8b8f7fa20a26": "بـــــــارق",
            "861f7b86-87cb-4543-86dc-b691763d1a09": "باريستا",
            "05043c72-111b-4b11-bc68-9af9e8ba604e": "فاشن",
            "431b7239-cf92-4220-9b00-1d66da0474fc": "زينة",
            "1b6b8489-c6fe-471a-87a0-39e6693b51a0": "زهرة",
            "f3bf0ce6-dea2-4ad4-ab7b-0415deaf7376": "تراث",
            "c03b3612-691c-42ce-a5db-1f9188506913": "منفرد",
            "20ed294b-c90c-4e02-b393-8d81c3be7fc8": "فرست الذهبي",
            "900d7538-daeb-4529-a9a9-e6c83505ec52": "روزيا",
            "9b5215c0-9c31-43a8-b1e7-796e659cad21": "سترة",
            "a83992c5-1af5-4f54-a427-52be8d580fd0": "رويال",
            "fbef5f5c-0a04-4fd3-8d1e-8cb9687f87a9": "قلوري",
            "483e7db3-f138-40aa-a9c4-06d33d60ae32": "المثالي",
            "04adf1e6-d074-4de1-a9cb-9b690a72ec47": "حسام"
        }', true);

        foreach ($sallaThemes as $id => $name) {
            Theme::updateOrCreate(
                ['external_id' => $id],
                ['name' => $name, 'platform' => 'Salla', 'is_active' => true]
            );
        }

        foreach ($zidThemes as $id => $name) {
            Theme::updateOrCreate(
                ['external_id' => $id],
                ['name' => $name, 'platform' => 'Zid', 'is_active' => true]
            );
        }
    }
}
